app/workers/delete_posts.rb

DELETE FROM `posts` WHERE `posts`.`id` = 6
---
  def perform
  	Post.destroy_all