app/controllers/application_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
def authentication
    # making a request to a secure route, token must be included in the headers
    begin
     decode_data = decode_user_data(request.headers["token"])
     if !decode_data
      render json: { message: "Unauthorized" },status: 401
      return
    end
    # getting user id from a nested JSON in an array.
    user_id= decode_data[0]['user_data']
    # find a user in the database to be sure token is for a real user
    user = User.find(user_id)