app/controllers/comments_controller.rb

def index
	comments = Comment.all
---
SELECT `comments`.* FROM `comments`

def create
		# get user_id from token
		begin
			decode_data = decode_user_data(request.headers["token"])
			user_id= decode_data[0]['user_data']
		#create comment and making sure this post exists
		post = Post.find(params[:post_id])
		comment = Comment.new(description: params[:description], post_id: params[:post_id],user_id: user_id)
		if comment.save
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 14 LIMIT 1
INSERT INTO `comments` (`description`, `created_at`, `updated_at`, `post_id`, `user_id`) VALUES ('thank you!!!', '2022-06-25 11:54:20.420354', '2022-06-25 11:54:20.420354', 3, 1)

  def update
  	begin
   #checks that this comment exists
   comment_id = params[:id]
   comment = Comment.find(comment_id)
  	#get user_id and check that this comment belongs to them before editing
  	decode_data = decode_user_data(request.headers["token"])
  	user_id= decode_data[0]['user_data']
  	comment = Comment.where(user_id: user_id, id: comment_id)
  	if comment.empty?
  		render json: {message: "This operation is not allowed"},status: 405
  		return
  	end
	#update post
	comment = comment[0]
	description = params[:description]
	#validating on description that user entered
	if params[:description]
		if (params[:description]).length < 2
			render json: {message:"Description must contain at least 2 characters"},status: 400
			return
		end
	else description = comment.description
	end
	#update comment
	comment = comment.update(description: description)
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 233 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`user_id` = 1 AND `comments`.`id` = 2
SELECT 1 AS one FROM `comments` WHERE `comments`.`user_id` = 2 AND `comments`.`id` = 1 LIMIT 1
UPDATE `comments` SET `comments`.`description` = 'sooo', `comments`.`updated_at` = '2022-06-25 11:57:29.285740' WHERE `comments`.`id` = 4

    def destroy
    	begin
  		#checking to see if this comment belongs to this user before deleting
  		comment_id = params[:id]
  		decode_data = decode_user_data(request.headers["token"])
  		user_id= decode_data[0]['user_data']
  		comment = Comment.find(comment_id)
  		comment = Comment.where(user_id: user_id, id: comment_id)
  		if comment.empty?
  			render json: {message: "This operation is not allowed"},status: 405
  			return
  		end
  		comment = comment[0]
  		#deleting comment
  		comment = comment.destroy
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 7 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`user_id` = 1 AND `comments`.`id` = 2
SELECT `comments`.* FROM `comments` WHERE `comments`.`user_id` = 2 AND `comments`.`id` = 7
SELECT 1 AS one FROM `comments` WHERE `comments`.`user_id` = 2 AND `comments`.`id` = 7 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 7