app/controllers/posts_controller.rb

INSERT INTO `posts` (`title`, `body`, `tags`, `created_at`, `updated_at`, `user_id`) VALUES ('testingggg', 'testing first post', '[\"lama\",\"ihab\"]', '2022-06-23 22:36:15.067256', '2022-06-23 22:36:15.067256', 2)
---
	def create
		# get user_id from token
		decode_data = decode_user_data(request.headers["token"])
		user_id= decode_data[0]['user_data']

		#validate for tags contains at least one tag and is an array
		tags = params[:tags]
		if !tags.kind_of?(Array)
			render json: {message: "Tags must be an array"},status: 417
			return
		end
		if tags.empty?
			render json: {message: "Tags must contain at least one item"},status: 417
			return
		end

		#create post
		post = Post.new(title: params[:title], body: params[:body],tags: params[:tags],user_id: user_id)

		if post.save

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 4 LIMIT 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 2 AND `posts`.`id` = 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 1 AND `posts`.`id` = 2
SELECT 1 AS one FROM `posts` WHERE `posts`.`user_id` = 1 AND `posts`.`id` = 2 LIMIT 1
---
  def update
  	begin
   #checks that this post exists
  	post_id = params[:id]
  	post = Post.find(post_id)
  	#get user_id and check that this post belongs to them before editing
  	decode_data = decode_user_data(request.headers["token"])
	user_id= decode_data[0]['user_data']
	post = Post.where(user_id: user_id, id: post_id)
	if post.empty?

UPDATE `posts` SET `posts`.`body` = 'see', `posts`.`tags` = '[\"edit_tags\"]', `posts`.`updated_at` = '2022-06-25 11:47:58.531837' WHERE `posts`.`id` = 2
---
		end
	else tags = post.tags
	end
	post = post.update(title: title,body: body,tags: tags)

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = NULL LIMIT 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 1 AND `posts`.`id` = 2
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 3 LIMIT 1
SELECT 1 AS one FROM `posts` WHERE `posts`.`user_id` = 1 AND `posts`.`id` = 5 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 2
---
  def destroy
  	#DELETE COMMENTS OF THIS POST AS WELL
  	begin
  		post_id = params[:id]
  		decode_data = decode_user_data(request.headers["token"])
	    user_id= decode_data[0]['user_data']
  		post = Post.find(post_id)
  		post = Post.where(user_id: user_id, id: post_id)
  		if post.empty?
  			render json: {message: "This operation is not allowed"},status: 405
		return
  		end
  		post = post[0]
  		post = post.destroy