app/controllers/sessions_controller.rb

 def signup
      #taking params user entered to create user
      user = User.new(email: params[:email], password: params[:password],name: params[:name],image: params[:image])
    # if user is saved
    if user.save
---
INSERT INTO `users` (`name`, `email`, `password`, `image`, `created_at`, `updated_at`) VALUES ('Lama Ihab', 'lama@gmail.com', '1234567', 'http://rfudijc.com', '2022-06-23 10:59:32.903870', '2022-06-23 10:59:32.903870')

  def login
    #find user by email
    user = User.find_by(email: params[:email])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'lama.@gor' LIMIT 1